// --------------------------------------------------------------------------------
// Oscillater.h
//
// 2016 / 04 / 07
// Created by:	Hayato Iwata
// --------------------------------------------------------------------------------

#pragma once

// --------------------------------------------------------------------------------
// クラスの定義
// --------------------------------------------------------------------------------
class Oscillater
{
public:

	// コンストラクタ & デストラクタ
	Oscillater(int noteNumber, double sampleRate);
	~Oscillater();

	// 値を返すメンバ関数
	double waveGenerate();


private:

	int m_NoteNumber;			// ノートナンバー
	double m_SampleRate;		// サンプリングレート

	double m_phase;				// 現在の位相
	double m_dw;				// 1サンプルあたりの位相差(角周波数)

};
